/*
 * name validation
 * เงื่อนไข: สามารถใช้ตัวอักษร ภาษาไทยหรืออังกฤษ, อย่างน้อย 3 ตัวอักษร, สูงสุด 15 ตัวอักษร
 */
export const name = /[^\u0E00-\u0E7Fa-zA-Z]{3,15}/;

/*
 * email validation
 * ต้องเป็นรูปแบบอีเมลโดยมี '@' '.' และลงท้ายด้วย com
 */
export const email = /^[^\s@]+@[^\s@]+\.(com)+$/;

/*
 * password validation:
 * (?=.*[0-9]): ต้องมีตัวเลขอย่างน้อย 1 ตัว
 * (?=.*[a-z]): ต้องมีตัวพิมพ์เล็กอย่างน้อย 1 ตัวอักษร
 * (?=.*[A-Z]): ต้องมีตัวพิมพ์ใหญ่อย่างน้อย 1 ตัวอักษร
 * (?=.*[!@#$%^&*]): ต้องมีอักขระพิเศษอย่างน้อย 1 ตัวอักษร
 * {6,15}: ต้องมีตัวอักษตรอย่างน้อย 8 ตัวอักษร สูงสุด 16 ตัวอักษร
 */
export const password = /^(?=.*[0-9])(?=.*[a-z])(?=.*[A-Z])(?=.*[!@#$%^&*])[a-zA-Z0-9!@#$%^&*]{8,16}$/;

/*
 * phone validation:
 * '^': ต้องตรงกับจุดเริ่มต้นของเงื่อนไขที่กำหนด
 * (0)' : ต้องตรงกับหลัก 0
 * \d{9}: ต้องมีตัวเลข 9 หลัก
 * $: ต้องตรงกับจุดสิ้นสุดของเงื่อนไขที่กำหนด
 */
export const phone = /^0\d{9}$/;
// Maximum length of 20.
export const PhoneNumber = /^(\+[0-9]{8,}|[0-9]{0,9})$/;
// Minimum length of 5. Maximum length of 8.
export const OneTimePassword = /^[0-9]+$/;
