/*
 * name validation
 * เงื่อนไข: สามารถใช้ตัวอักษร ภาษาไทยหรืออังกฤษ, อย่างน้อย 3 ตัวอักษร, สูงสุด 15 ตัวอักษร
 */
export const name = /[^\u0E00-\u0E7Fa-zA-Z]{3,15}/;

/*
 * email validation
 * ต้องเป็นรูปแบบอีเมลโดยมี '@' '.' และลงท้ายด้วย com
 */
export const email = /^[^\s@]+@[^\s@]+\.(com)+$/;

/*
 * password validation:
 * (?=.*[0-9]): มีตัวเลขอย่างน้อย 1 ตัว
 * (?=.*[a-z]): มีตัวพิมพ์เล็กอย่างน้อย 1 ตัวอักษร
 * (?=.*[A-Z]): มีตัวพิมพ์ใหญ่อย่างน้อย 1 ตัวอักษร
 * (?=.*[!@#$%^&*]): มีอักขระพิเศษอย่างน้อย 1 ตัวอักษร
 * {6,15}: ตัวอักษตรอย่างน้อย 6 ตัวอักษร สูงสุด 15 ตัวอักษร
 */
export const password = /^(?=.*[0-9])(?=.*[a-z])(?=.*[A-Z])(?=.*[!@#$%^&*])[a-zA-Z0-9!@#$%^&*]{6,15}$/;
